# GetAnalyticalSurfaces Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisDetailModel..::..GetAnalyticalSurfaces Method
EnergyAnalysisDetailModel Class See Also
---
The collection of analytical surfaces.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<EnergyAnalysisSurface> GetAnalyticalSurfaces()
```

Visual Basic
---
```text
Public Function GetAnalyticalSurfaces As IList(Of EnergyAnalysisSurface)
```

Visual C++
---
```text
public:
IList<EnergyAnalysisSurface^>^ GetAnalyticalSurfaces()
```

# ### Return Value
Returns the analytical surfaces after model calculation.
# See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace